import React from "react";
import "./style.css";
import { useNavigate } from "react-router-dom";
import Nav from "../Nav";
import { Splide, SplideSlide } from "@splidejs/react-splide";
import "@splidejs/splide/dist/css/splide.min.css";


function Home() {
  const Navigate = useNavigate();

  const register = () => {
    Navigate("/regist");
  };

  const login = () => {
    Navigate("/login");
  };

  return (
    <>
      <Nav />

      <div className="home1"></div>

      {/* just to make scrolling effect possible */}
      {/* <h2 className="myH2">What is this ?</h2> */}
      {/* <p className="myP">This is a responsive fixed navbar animated on scroll</p>
    <p className="myP">
      I took inspiration from ABDO STEIF (
      <a href="https://codepen.io/abdosteif/pen/bRoyMb?editors=1100">
        https://codepen.io/abdosteif/pen/bRoyMb?editors=1100
      </a>
      ) and Dicson{" "}
      <a href="https://codepen.io/dicson/pen/waKPgQ">
        (https://codepen.io/dicson/pen/waKPgQ)
      </a>
    </p> */}
      {/* <div className="homelawyer"> */}

      {/* <div className="title">
          <h5>أجمل ماقاله الدكتور السنهوري في المحاماة</h5>
          </div> */}
      {/* <div className="descraptin">
          
          </div>
        </div> */}
      {/* <Splide>
  <SplideSlide>
    <p> تجربة فقط</p>
  </SplideSlide>
  <SplideSlide>
    <img src='/imag/logo.png' alt="Image 2"/>
  </SplideSlide>
</Splide> */}

      <main className="mainhome">

        <div className="image-intro">
          <div className="first-section">
            <img
              src="https://cdn02.qudsn.co/thumb/w1110/uploads/images/2020/06/Ri073.jpg"
              alt="Mountain peak covered in snow"
            />
            <div className="info-background">
              <p className="homep">
                المُحاماَة فَنّ قَبْلَ أَن تَكُون مِهْنَة .. لِيس المُحامُونَ
                مُحامِيْنَ كَلَهِم بِالضَرُورَة .. لِيس عَمَل المُحامِي فَقَط
                مَعْرِفَة القانُون .. فَالكَثِير يُعَرِّف النُصُوص حَتَّى مِن
                غَيَّرَ المُحامِيْنَ .. لَكُننَ حَقِيقَة دَوْر المُحامِي تَكْمُن
                فِيَّ دَرّاسَة الوَقائِع كَدَرّاسَة القانُون وَالنَظَر إِلَى ما
                يَمْثُل هٰذِهِ الوَقائِع فِيَّ نَصَوْص القانُون .. المُحاماَة
                فَنّ الحُجَّة وَالجَدَل وَالبُرْهان وَالإِقْناع .. فَقَدَ كَآن
                رُوّاد الفَلْسَفَة مُحامِيْنَ بِما يُمَلِّكُونَ مِن حُجَج
                وَلُغَة عالِيَة وَنَظْرَة ثاقِبَة .. وَكَثِير مِن الشَعْراء
                كانُوا مُحامِيْنَ بِما يَمْتَلِكُونَ مِن أَدَوات اللُغَة
                وَالبَلاغَة وَالفَطِنَة .. فَلَيْسَ عَمَل المُحامِي الفَصْل
                فِيَّ النُزّاع إِنَّما هُو عَمَل القاضِي . لِيس مِن عَمَل
                المُحامِيْنَ قَلَّبَ الثَوابِت أُو تظليل الحَقائِق .. فَلا
                تُشْعِر بِالفَخْر كَثِيرا عَنْدَماً تَوَزَّعَ الرَشاوَى لِكَسْب
                القَضايا لِأَنَّكِ أَصْبَحتِ مُجْرِماً بِسَبَب مُجْرِم فَأَنَت
                إِذْن مِثْلهُ لِأَنَّكِ تُخْسِر ذاتكَ لِتَرْبَح قَضِيَّة ..
                فَالقَضِيَّة رابِحَة وَ سَتُكَوِّن أَنَت الخاسِر .. أَن تَسْرِق
                حُقُوق زُمَلاءكَ المُحامِيْنَ وَإِن تَنافَسَهُم بِصُور غَيَّرَ
                مَشْرُوعَة فَهٰذا أَقْرَب لِلدَناءَة وَ أُبْعِدَ ما يَكُون مِن
                الأَخْلاق الرَفِيعَة آلَتَيْيَ هِيَ أَساس مَهَنتُكِ .. لا
                تُكْذَب وَ لا تُعْط الوُعُود فَأَنَت لَسْتِ صاحِب قَرار وَلُستَ
                مَسْؤُولاً عَن النَتائِج .. وَ قَبْلَ ذُلّكَ كُلّهُ كَنَّ
                إنســانا لِتُكَنّ مُحامِيا .. لا تُكَسِّب دَعْوَى وَتَخْسَر
                نَفِسَكَ ..
              </p>
            </div>
          </div>
          <div className="second-section">
            <img
              src="https://mybayutcdn.bayut.com/mybayut/wp-content/uploads/ar-%D9%82%D8%A7%D9%86%D9%88%D9%86-%D8%A7%D9%84%D8%A7%D9%8A%D8%AC%D8%A7%D8%B1-%D9%81%D9%8A-%D8%A3%D8%A8%D9%88%D8%B8%D8%A8%D9%8A-new.jpg"
              alt="Looking over peaks from inside a plane"
            />
            <div className="">
              <p>
                المُحاماَة فَنّ قَبْلَ أَن تَكُون مِهْنَة .. لِيس المُحامُونَ
                مُحامِيْنَ كَلَهِم بِالضَرُورَة .. لِيس عَمَل المُحامِي فَقَط
                مَعْرِفَة القانُون .. فَالكَثِير يُعَرِّف النُصُوص حَتَّى مِن
                غَيَّرَ المُحامِيْنَ .. لَكُننَ حَقِيقَة دَوْر المُحامِي تَكْمُن
                فِيَّ دَرّاسَة الوَقائِع كَدَرّاسَة القانُون وَالنَظَر إِلَى ما
                يَمْثُل هٰذِهِ الوَقائِع فِيَّ نَصَوْص القانُون .. المُحاماَة
                فَنّ الحُجَّة وَالجَدَل وَالبُرْهان وَالإِقْناع .. فَقَدَ كَآن
                رُوّاد الفَلْسَفَة مُحامِيْنَ بِما يُمَلِّكُونَ مِن حُجَج
                وَلُغَة عالِيَة وَنَظْرَة ثاقِبَة .. وَكَثِير مِن الشَعْراء
                كانُوا مُحامِيْنَ بِما يَمْتَلِكُونَ مِن أَدَوات اللُغَة
                وَالبَلاغَة وَالفَطِنَة .. فَلَيْسَ عَمَل المُحامِي الفَصْل
                فِيَّ النُزّاع إِنَّما هُو عَمَل القاضِي . لِيس مِن عَمَل
                المُحامِيْنَ قَلَّبَ الثَوابِت أُو تظليل الحَقائِق .. فَلا
                تُشْعِر بِالفَخْر كَثِيرا عَنْدَماً تَوَزَّعَ الرَشاوَى لِكَسْب
                القَضايا لِأَنَّكِ أَصْبَحتِ مُجْرِماً بِسَبَب مُجْرِم فَأَنَت
                إِذْن مِثْلهُ لِأَنَّكِ تُخْسِر ذاتكَ لِتَرْبَح قَضِيَّة ..
                فَالقَضِيَّة رابِحَة وَ سَتُكَوِّن أَنَت الخاسِر .. أَن تَسْرِق
                حُقُوق زُمَلاءكَ المُحامِيْنَ وَإِن تَنافَسَهُم بِصُور غَيَّرَ
                مَشْرُوعَة فَهٰذا أَقْرَب لِلدَناءَة وَ أُبْعِدَ ما يَكُون مِن
                الأَخْلاق الرَفِيعَة آلَتَيْيَ هِيَ أَساس مَهَنتُكِ .. لا
                تُكْذَب وَ لا تُعْط الوُعُود فَأَنَت لَسْتِ صاحِب قَرار وَلُستَ
                مَسْؤُولاً عَن النَتائِج .. وَ قَبْلَ ذُلّكَ كُلّهُ كَنَّ
                إنســانا لِتُكَنّ مُحامِيا .. لا تُكَسِّب دَعْوَى وَتَخْسَر
                نَفِسَكَ ..
              </p>
            </div>
          </div>
        </div>
        <footer>
          <div className="copyright-info">
          <p>جميع الحقوق محفوظة © 2022 محمد الوهيد </p>

            <p>Copyright © 2022 HackerYou </p>

          </div>
        </footer>
      </main>
    </>
  );
}

export default Home;
